app/controllers/admins_controller.rb

INSERT INTO "admins" ("username", "email", "phone_number", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def register
        user = Admin.create(user_params)

SELECT "admins".* FROM "admins" WHERE (username = 'admin') ORDER BY "admins"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username"

        user = Admin.where(sql, { username: user_params[:username], email: user_params[:email] }).first