app/controllers/application_controller.rb

SELECT "customers".* FROM "customers" WHERE (email = 'ceoian848@gmail.com') ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def if_customer_exists
        sql = "email = :email"
        user = Customer.where(sql, { email: user_params[:email] }).first

SELECT "customers".* FROM "customers" WHERE (password_reset_token = 'ceoian848@gmail.com') ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def if_customer_exists_by_password_reset
        sql = "password_reset_token = :password_reset_token"
        user = Customer.where(sql, { password_reset_token: user_params[:password_reset_token] }).first