app/controllers/cars_controller.rb

    def new_car
        car = Car.create(car_params)
---
INSERT INTO "cars" ("model", "brand", "price", "year_of_manufacture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["model", ""], ["brand", "ianoz"], ["price", 0], ["year_of_manufacture", ""], ["created_at", "2023-08-26 20:48:53.100818"], ["updated_at", "2023-08-26 20:48:53.100818"]]

    def index
        @car = Car.all

        images = []
        @car.each do | car |
---
SELECT "cars".* FROM "cars"