app/controllers/customers_controller.rb

    def forgot_password_step_1
        user = if_customer_exists()
        if user
            # Generating Reset Token
            random_string = SecureRandom.hex(3)
            user.password_reset_token = random_string
            user.save
---
UPDATE "customers" SET "password_reset_token" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["password_reset_token", "[FILTERED]"], ["updated_at", "2023-09-18 17:56:33.500063"], ["id", 1]]

    def forgot_password_step_2
        user = if_customer_exists_by_password_reset

        if user
            user.password = params[:new_password]
            user.password_confirmation = params[:new_password_confirmation]

            user.save
---
UPDATE "customers" SET "password_digest" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-08-24 21:56:07.256199"], ["id", 1]]