app/controllers/customers_controller.rb

INSERT INTO "customers" ("username", "email", "phone_number", "password_digest", "password_reset_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def register
        user = Customer.create(user_params)

SELECT "customers".* FROM "customers" WHERE (username = 'ian') ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username"

        user = Customer.where(sql, { username: user_params[:username], email: user_params[:email] }).first

SELECT "customers".* FROM "customers" WHERE (email = 'ceoian848@gmail.com') ORDER BY "customers"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def forgot_password
        sql = "email = :email"
        user = Customer.where(sql, { email: user_params[:email] }).first