app/controllers/mpesas_controller.rb

    def get_access_token
        res = generate_access_token_request()
        if res.code != 200
        r = generate_access_token_request()
        if res.code != 200
        raise MpesaError('Unable to generate access token')
        end
        end
        body = JSON.parse(res, { symbolize_names: true })
        token = body[:access_token]
        AccessToken.destroy_all()
        AccessToken.create!(token: token)
---
DELETE FROM "access_tokens" WHERE "access_tokens"."id" = ?  [["id", 52]]
INSERT INTO "access_tokens" ("token", "created_at", "updated_at") VALUES (?, ?, ?)  [["token", "[FILTERED]"], ["created_at", "2023-08-21 10:41:54.947235"], ["updated_at", "2023-08-21 10:41:54.947235"]]